etc/OpenFOAM_Sample_Files/indoor_temperature/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		controlDict;
}

#include		"probes";

application		buoyantBoussinesqSimpleFoam;

startFrom		latestTime;

startTime		0;

stopAt		endTime;

endTime		250;

deltaT		1;

writeControl		timeStep;

writeInterval		100;

purgeWrite		0;

writeFormat		ascii;

writePrecision		6;

writeCompression		true;

timeFormat		general;

timePrecision		6;

runTimeModifiable		true;