etc/OpenFOAM_Sample_Files/indoor_temperature/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "3/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    west_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15708;
        startFace       840754;
    }
    room
    {
        type            wall;
        inGroups        1(wall);
        nFaces          27205;
        startFace       856462;
    }
    east_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          31724;
        startFace       883667;
    }
)

// ************************************************************************* //
