etc/OpenFOAM_Sample_Files/indoor_temperature/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    west_window
    {

        type		zeroGradient;

    }

    room
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;

    }

    east_window
    {

		type		fixedValue;

        value		uniform 0;

    }

}

// ************************************************************************* //
