etc/OpenFOAM_Sample_Files/indoor_temperature/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    west_window
    {

        type		zeroGradient;

    }

    room
    {

        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;

    }

    east_window
    {

		type		zeroGradient;

    }

}

// ************************************************************************* //
