etc/OpenFOAM_Sample_Files/indoor_temperature/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		k;
}

dimensions		[0 2 -2 0 0 0 0];

internalField		uniform 0.1;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    west_window
    {

        type		fixedValue;

        value		uniform 0.1;

    }

    room
    {

        type		kqRWallFunction;

        value		uniform 0.1;

    }

    east_window
    {

        type		zeroGradient;

    }

}