etc/OpenFOAM_Sample_Files/indoor_temperature/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSchemes;
}

ddtSchemes
{

    default		steadyState;

}

gradSchemes
{

    grad(U)		cellMDLimited Gauss linear 0.5;

    default		cellMDLimited Gauss linear 0.5;

}

divSchemes
{

    div(phi,epsilon)		bounded Gauss linearUpwind default;

    div(phi,U)		bounded Gauss linearUpwind grad(U);

    div(phi,T)		bounded Gauss linearUpwind default;

	div((nuEff*dev2(T(grad(U)))))		Gauss linear;

    div(phi,k)		bounded Gauss linearUpwind default;

    div(phi,omega)		bounded Gauss linearUpwind default;

}

laplacianSchemes
{

    default		Gauss linear limited 1.0;

}

interpolationSchemes
{

    default		linear;

}

snGradSchemes
{

    default		limited 1.0;

}

fluxRequired
{

    p		;

    default		no;

}