etc/OpenFOAM_Sample_Files/indoor_temperature/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.2 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSolution;
}

solvers
{

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.01;
    }

    U
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    k
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    "(epsilon|T)"
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

}

SIMPLE
{

    nNonOrthogonalCorrectors		2;

    residualControl
    {

        k		0.0001;

        U		0.0001;

        epsilon		0.0001;

        p_rgh		0.0001;
		
		T		0.0001;

    }

}

relaxationFactors
{

    p_rgh		0.3;

    U		0.7;

    k		0.7;

    epsilon		0.7;
	
	T			0.5;

}